## Books (Core)
---
* ### Ingrid Arbieto Nelson

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Books-(Core)" data-toc-modified-id="Books-(Core)-1">Books (Core)</a></span><ul class="toc-item"><li><span><a href="#Ingrid-Arbieto-Nelson" data-toc-modified-id="Ingrid-Arbieto-Nelson-1.1">Ingrid Arbieto Nelson</a></span></li></ul></li><li><span><a href="#Assignment:" data-toc-modified-id="Assignment:-2">Assignment:</a></span><ul class="toc-item"><li><span><a href="#Part-1:-Design-an-ERD" data-toc-modified-id="Part-1:-Design-an-ERD-2.1">Part 1: Design an ERD</a></span></li><li><span><a href="#Books-ERD" data-toc-modified-id="Books-ERD-2.2">Books ERD</a></span></li><li><span><a href="#Part-2:-Create-the-database-in-Python" data-toc-modified-id="Part-2:-Create-the-database-in-Python-2.3">Part 2: Create the database in Python</a></span><ul class="toc-item"><li><span><a href="#Testing-the-Database" data-toc-modified-id="Testing-the-Database-2.3.1">Testing the Database</a></span></li><li><span><a href="#Books-table" data-toc-modified-id="Books-table-2.3.2">Books table</a></span></li><li><span><a href="#Users-table" data-toc-modified-id="Users-table-2.3.3">Users table</a></span></li><li><span><a href="#Authors-table" data-toc-modified-id="Authors-table-2.3.4">Authors table</a></span></li><li><span><a href="#Favorites-table" data-toc-modified-id="Favorites-table-2.3.5">Favorites table</a></span></li></ul></li><li><span><a href="#Part-3:-Exporting-the-database-and-committing-to-GitHub" data-toc-modified-id="Part-3:-Exporting-the-database-and-committing-to-GitHub-2.4">Part 3: Exporting the database and committing to GitHub</a></span></li></ul></li></ul></div>

## Assignment:
Consider the following "flat" file that a start-up has just started using for its first customers: Client's Original File. They quickly realized that saving this information in .csv format will not meet their needs as they grow. First, consider how you would design a relational database to meet their needs. Be sure to consider conventions of normalization and what information should be separated.

### Part 1: Design an ERD
Create an ERD (figure out how many tables to include and the relationships between them) to represent a database that tracks users and their favorite books. Here are some considerations as you design the database:

* For the purposes of this assignment, you may assume that each book only has one author (or that we are only tracking the primary author), but that the same author may have written multiple books.
* Each user should have a first name, last name, and email.
* We will be saving a list of each user's favorite books.
* Each book should have a title and an author. (The author's whole name can be one attribute)
* Note that each user will have multiple favorite books, and a book could certainly be the favorite of many users.
* Use the MySQL Workbench for designing the ERD.
* Hint: When you link two tables with a many to many relationship, MySQL Workbench will automatically create a joiner table for you! It will also automatically make the keys primary keys, which you will want to uncheck.

Insert the image of your ERD into the first markdown cell of your Jupyter Notebook. Use the example markdown syntax for inserting an image.

```
![png](image_filename.png)
```

### Books ERD

<img src = 'Images/books.png'>

### Part 2: Create the database in Python
Continue working in Jupyter Notebook with the ERD image.

Rather than creating the database in MySQL workbench with forward engineering, we are going to develop our Python skills by creating the database in Python using PyMySQL that you practiced in the "MySQL with Python" lesson.

Note that working with MySQL via Python will be a required component of the belt exam, so getting comfortable with it now will help prepare you!

You will need to create a connection. This time, you may wish to call it "books"

```
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"
```

Normally, you would have to take the time to transform the original .csv file from your client into the appropriate normalized tables. However, for this task, **the transformation steps have been completed for you** and you are provided a .csv for each table you will need. (Note that you will be learning and practicing efficient ways to make these transformations next week!)

The four files you will need to add as tables to your database are:

* users

* books

* authors

* favorites

Note that these files may not perfectly match the schema you designed. Notice how they are different, but move forward with these tables even if they are not exactly the same as your original plan. (Notably, we will not have created_at and updated_at attributes)

Once you have added these tables to your database, the database is now available to query from MySQL workbench OR in your Jupyter Notebook using SQLAlchemy!

#### Testing the Database
After creating your 4 tables, you should run the "SHOW TABLES;" query in your notebook.

As a final step to this task, write a query at the end of your Jupyter Notebook to list the titles of all of John Doe's favorite books. An example of the SQL syntax: Note this will depend on how you named your tables.

```
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
```

In [1]:
# create sql connection
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:wtnwmtsTarFom6^@localhost/books"

In [2]:
# create connection
engine = create_engine(connection_str)

In [3]:
# create books database
create_database(connection_str)

In [4]:
# check if database exists
database_exists(connection_str)

True

In [5]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

#### Books table

In [6]:
# import pandas
import pandas as pd

# load books table
bks = pd.read_csv('Data/books.csv')
bks.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [7]:
# add books table to books database
bks.to_sql('bks', engine, if_exists = 'replace', index=False)

6

In [8]:
# read from books table
q = """SELECT * FROM bks;"""
pd.read_sql(q, engine)

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

SyntaxError: invalid syntax (1105682697.py, line 1)

#### Users table

In [9]:
# load users table
users = pd.read_csv('Data/users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [10]:
# add users table to books database
users.to_sql('users', engine, if_exists = 'replace', index=False)

3

In [11]:
# read from users table
q = """SELECT * FROM users;"""
pd.read_sql(q, engine)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

#### Authors table

In [12]:
# load authors table
authors = pd.read_csv('Data/authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [13]:
# add authors table to books database
authors.to_sql('authors', engine, if_exists = 'replace', index=False)

5

In [14]:
# read from authors table
q = """SELECT * FROM authors;"""
pd.read_sql(q, engine)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [16]:
ALTER TABLE authors
DROP INDEX index;

SyntaxError: invalid syntax (2142184428.py, line 1)

#### Favorites table

In [15]:
# load favorites table
favorites = pd.read_csv('Data/favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [16]:
# add favorites table to books database
favorites.to_sql('favorites', engine, if_exists = 'replace', index=False)

7

In [17]:
# read from favorites table
q = """SELECT * FROM favorites;"""
pd.read_sql(q, engine)

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5
5        3        5
6        3        6

In [18]:
# show all tables in books database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1             bks
2       favorites
3           users

In [19]:
# Test db - select favorite books for John Doe
q = """SELECT bks.title, favorites.user_id
FROM bks
JOIN favorites ON bks.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND 
    users.first_name = "John"));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

### Part 3: Exporting the database and committing to GitHub
Now that you've created your database and verified it works, open MySQL Workbench and use the Export Database tool to save the .SQL file for your database in your assignment repository.

Add both of these files to your GitHub repository:

* Jupyter Notebook (including the ERD from Part 1 and code for Part 2)
* Exported .sql file.

Submit the repository link for this assignment.